#+TITLE: Tema 7: Ficheros
#+DATE:
#+STARTUP: beamer
#+SETUPFILE: config.org
#+PROPERTY: header-args :tangle code/07-Ficheros.c :comments org
#+OPTIONS: H:2


** Ejemplo

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  int i, vals[3];
  FILE *pf;
  // Abrimos fichero para lectura
  pf = fopen("datos.txt", "r");
  // Leemos datos separados por comas
  fscanf(pf, "%i, %i, %i",
	 &vals[0], &vals[1], &vals[2]);
  fclose(pf);
  // Mostramos en pantalla lo leído
  for (i = 0; i < 3; i++)
    printf("%i\t", vals[i]);

  return(0);
}
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |

** Ejemplo: longitud (bytes) de un fichero

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  long int fsize; // tamaño del fichero
  FILE *pf;
  pf = fopen("datos.txt", "r");
  // Desplaza al final
  fseek(pf, 0, SEEK_END);
  //Almacena la posición
  fsize = ftell(pf);
  printf("El fichero tiene %li elementos.\n",
	 fsize);
  return 0;
}
#+END_SRC

#+RESULTS:
: El fichero tiene 7 bytes.
